/**
 * 常量
 */

// token 超时时间
export const EXPIRED = 3 * 24 * 60 * 60

// 值空时默认显示的值
export const EMPTY_VALUE = '-'

// 接口异常
export const FETCH_CODE = {
  200: '请求成功',
  201: '新建或修改数据成功',
  202: '正在处理流程...',
  204: '删除数据成功',
  400: '请求错误',
  401: '用户验证错误',
  403: 'token 失效',
  404: '服务器找不到请求的资源',
  406: '请求格式错误',
  410: '请求的资源已不存在',
  422: '验证错误',
  500: '服务器错误',
  502: '网关错误',
  503: '服务器维护中',
  504: '网关超时'
}

// token 异常
export const LOGIN_ERROR_CODE = {
  '-2': 'Access key 错误',
  '-4': '没有权限',
  '-101': '账号未登录',
  '-102': '账号被封停',
  '-105': '验证码错误',
  '-106': '账号未激活',
  '-304': '没有改动',
  '-307': '撞车跳转',
  '-400': '请求错误',
  '-401': '未认证',
  '-403': '访问权限不足',
  '-404': '服务器找不到请求的资源',
  '-405': '方法不支持',
  '-409': '冲突',
  '-500': '服务器错误',
  '-503': '过载保护，服务暂不可用',
  '-504': '服务调用超时',
  '-509': '超出限制',
  '-616': '上传文件不存在',
  '-617': '上传文件太大',
  '-625': '登录失败次数过多',
  '-626': '用户不存在',
  '-628': '用户密码弱',
  '-629': '用户名或密码错误',
  '-643': '用户被锁定',
  '-658': 'Token 过期',
  '-1200': '请求降级',
  '-1201': 'rpc client 不可用',
  '-1202': 'rpc client 没有授权'
}
